FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/тт_СкидкиНаАвтомобиль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>тт_СкидкиНаАвтомобиль</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Одобрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ДоступКПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступКПодразделениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКПодразделениям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ТТ_СоответствиеДокументовМеждуХолдингом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТ_СоответствиеДокументовМеждуХолдингом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументПриемник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.Корректировка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументИсточник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетЗапрос</Name>
					<Comment>Интернет-запрос</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мойка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
			<Comment>Типы договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВиртуальныйДоговор</Name>
					<Comment>Виртуальный договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСтрахования</Name>
			<Comment>Перечисление видов страхования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскоеСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КАСКО</Name>
					<Comment>КАСКО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСАГО</Name>
					<Comment>ОСАГО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрахованиеИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GAP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомощьНаДороге</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродленнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ПризнакиАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиАгента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БанковскийПлатежныйАгент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийПлатежныйСубагент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным субагентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйСубагент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным субагентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поверенный</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся поверенным</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся комиссионером</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся агентом и не являющимся банковским платежным агентом (субагентом), платежным агентом (субагентом), поверенным, комиссионером</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ТТ_Общий/Ext/Module.bsl
//----ПРОЦЕДУРЫ РАБОТЫ С ФОРМОЙ--Начало--
Процедура ФормаПередОткрытием(ЭтаФорма) Экспорт
	#Если Клиент Тогда
		Объект=ЭтаФорма.ЭтотОбъект;
		
		ИмяДокумента=Объект.Метаданные().Имя;
		
		
		//Попытка
		ОсновнаяПанель=ЭтаФорма.ЭлементыФормы.Найти("ОсновнаяПанель");
		Если ОсновнаяПанель <> Неопределено Тогда
			
			ТекСтраница=ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница;
			
			ВысотаОбщаяДобавляемыхЭлементовПоВертикали = 27; // Общая высота всех добавляемых элементов
			ВысотаОдногоЭлемента = 19;
			РасстояниеМеждуЭлементами = 3;
			ПоложениеПервогоЭлемента =8;		
			ПоложениеПервогоЭлементаЛево =РасстояниеМеждуЭлементами;		
			ШиринаЗаголовка=190;
			ШиринаПоля=140;
			
			//------------Добавляем Кнопку Установка скидок----------------
			Если ИмяДокумента="РабочийЛист" Тогда
				
				//Элемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Надпись"), "УстановкаСкидок", Истина, ЭтаФорма.ЭлементыФормы.ОсновнаяПанель);
				//Элемент.Заголовок=ТТ_Общий.ПолучитьПредставлениеЗаголовкаСкидки(Объект);
				//Элемент.Гиперссылка = Истина;
				//Элемент.УстановитьДействие("Нажатие", Новый Действие("ТТ_УстановкаСкидок"));
				//Элемент.ЦветТекста=WebЦвета.Красный;
				//Элемент.Лево = 140;
				//Элемент.Верх = 165;
				//Элемент.Высота = ВысотаОдногоЭлемента;
				//Элемент.Ширина = ШиринаПоля;
				//
				//Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Право,
				//ЭтаФорма.ЭлементыФормы.РазделительВертикальный,
				//ГраницаЭлементаУправления.Право);
				//
				//Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Низ,
				//ЭтаФорма.ЭлементыФормы.УстановкаСкидок,
				//ГраницаЭлементаУправления.Верх);
				//
				
			ИначеЕсли ИмяДокумента="Событие" Тогда
				ДействияФормы = "ДействияФормы";
				Попытка
					ПанельДействия = ЭтаФорма.ЭлементыФормы[ДействияФормы];
				Исключение
					Возврат;
				КонецПопытки;	
				
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиРазделительMango");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиРазделительMango",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли;				
				Кнопка = ПанельДействия.Кнопки.Найти("ЗаписьРазговораMango");
				Если Кнопка = Неопределено Тогда
					Кнопка = ПанельДействия.Кнопки.Добавить("ЗаписьРазговораMango",ТипКнопкиКоманднойПанели.Действие," Запись разговора",Новый Действие("ДействияФормыТТ_Mango"));
				КонецЕсли;				
				
			ИначеЕсли ИмяДокумента="ЗаказНаАвтомобиль" Тогда
				Элемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Надпись"), "УстановкаСкидок", Истина, ЭтаФорма.ЭлементыФормы.ОсновнаяПанель);
				Элемент.Заголовок=ТТ_Общий.ПолучитьПредставлениеЗаголовкаСкидки(Объект);
				Элемент.Гиперссылка = Истина;
				Элемент.УстановитьДействие("Нажатие", Новый Действие("ТТ_УстановкаСкидок"));
				Элемент.ЦветТекста=WebЦвета.Красный;
				Элемент.Лево = 448;
				Элемент.Верх = 206;
				Элемент.Высота = ВысотаОдногоЭлемента;
				Элемент.Ширина = 180;
				//Элемент.Шрифт=Новый Шрифт(Элемент.Шрифт,,12);
				Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Право,
				ЭтаФорма.ЭлементыФормы.ОсновнаяПанель,
				ГраницаЭлементаУправления.Право);
				
				Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Лево,
				ЭтаФорма.ЭлементыФормы.ПроцентСкидкиНаАвтомобиль,
				ГраницаЭлементаУправления.Право);			
				
				//Уберем видимость штатных скидок
				ЭтаФорма.ЭлементыФормы.тСкидкаНаценкаНаАвтомобиль.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.СкидкаНаценкаНаАвтомобиль.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.тПроцентСкидкиНаАвтомобиль.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.ПроцентСкидкиНаАвтомобиль.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.тМаркетинговаяПрограмма.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.МаркетинговаяПрограмма.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.тСуммаСкидкиНаАвтомобиль.Видимость=Ложь;
				ЭтаФорма.ЭлементыФормы.СуммаСкидкиНаАвтомобиль.Видимость=Ложь;
				
				
			КонецЕсли;
			
			////----------Добавляем владку Дополнительные реквизиты - они же Значения свойств объектов----------
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	НазначенияСвойствОбъектовВидыСвойств.Свойство,
			//|	НазначенияСвойствОбъектовВидыСвойств.Свойство.ТипЗначения КАК ТипЗначения,
			//|	ЗначенияСвойствОбъектов.Значение
			//|ИЗ
			//|	ПланВидовХарактеристик.НазначенияСвойствОбъектов.ВидыСвойств КАК НазначенияСвойствОбъектовВидыСвойств
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			//|		ПО НазначенияСвойствОбъектовВидыСвойств.Свойство = ЗначенияСвойствОбъектов.Свойство
			//|			И (ЗначенияСвойствОбъектов.Объект = &Объект)
			//|ГДЕ
			//|	НазначенияСвойствОбъектовВидыСвойств.Ссылка = &Ссылка
			//|	И НазначенияСвойствОбъектовВидыСвойств.Ссылка.ПометкаУдаления = ЛОЖЬ
			//|	И НазначенияСвойствОбъектовВидыСвойств.Свойство.ПометкаУдаления = ЛОЖЬ";
			//
			//
			//
			//Попытка
			//	Запрос.УстановитьПараметр("Ссылка", ПланыВидовХарактеристик.НазначенияСвойствОбъектов["Документ_"+ЭтаФорма.ЭтотОбъект.Метаданные().Имя] );
			//	Запрос.УстановитьПараметр("Объект", ЭтаФорма.ЭтотОбъект.Ссылка);
			//	
			//	РезультатЗапроса = Запрос.Выполнить();
			//	Если РезультатЗапроса.Пустой() Тогда 
			//		Возврат;
			//	КонецЕсли;
			//Исключение
			//	Возврат;
			//КонецПопытки;
			//
			//ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы.Добавить("ДопРеквизиты","Дополнительные реквизиты");
			//ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница=ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы["ДопРеквизиты"];
			//
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//ВысотаОбщаяДобавляемыхЭлементовПоВертикали=0;
			//
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	//Заголовок
			//	Элемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Надпись"), "Надпись"+ВыборкаДетальныеЗаписи.Свойство.Код , Истина, ЭтаФорма.ЭлементыФормы.ОсновнаяПанель);
			//	Элемент.Заголовок=ВыборкаДетальныеЗаписи.Свойство;
			//				
			//	// Настройка
			//	
			//	Элемент.Лево = ПоложениеПервогоЭлементаЛево;
			//	Элемент.Верх = ПоложениеПервогоЭлемента;
			//	Элемент.Высота = ВысотаОдногоЭлемента;
			//	Элемент.Ширина = ШиринаЗаголовка;
			//	
			//	Элемент = ЭтаФорма.ЭлементыФормы.Добавить(Тип("ПолеВвода"), "Свойство_"+ВыборкаДетальныеЗаписи.Свойство.Код, Истина, ЭтаФорма.ЭлементыФормы.ОсновнаяПанель);
			//	Элемент.ТипЗначения = ВыборкаДетальныеЗаписи.ТипЗначения;
			//	Если Строка(Элемент.ТипЗначения) = "Значения свойств" Тогда
			//		Элемент.ВыборПоВладельцу=ВыборкаДетальныеЗаписи.Свойство;
			//	КонецЕсли;
			//				
			//	// Настройка
			//	
			//	Элемент.Лево = ПоложениеПервогоЭлементаЛево + ШиринаЗаголовка + РасстояниеМеждуЭлементами;
			//	Элемент.Верх = ПоложениеПервогоЭлемента;
			//	Элемент.Высота = ВысотаОдногоЭлемента;
			//	Элемент.Ширина = ШиринаПоля;
			//	Если ВыборкаДетальныеЗаписи.Значение<> Null Тогда
			//		Элемент.Значение=ВыборкаДетальныеЗаписи.Значение;
			//	КонецЕсли;
			//	
			//	ПоложениеПервогоЭлемента=+ПоложениеПервогоЭлемента+РасстояниеМеждуЭлементами+ВысотаОдногоЭлемента;
			//	ВысотаОбщаяДобавляемыхЭлементовПоВертикали=ВысотаОбщаяДобавляемыхЭлементовПоВертикали+РасстояниеМеждуЭлементами+ВысотаОдногоЭлемента;
			//	
			//	//Если ПоложениеПервогоЭлемента > ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Высота-30 Тогда
			//	//	ЭтаФорма.Высота = ЭтаФорма.Высота+РасстояниеМеждуЭлементами+ВысотаОдногоЭлемента;
			//	//	ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Высота=ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Высота+РасстояниеМеждуЭлементами+ВысотаОдногоЭлемента;
			//	//КонецЕсли;
			//	//
			//	Если ПоложениеПервогоЭлемента > ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Высота-30 Тогда
			//		ПоложениеПервогоЭлемента=8;
			//		ПоложениеПервогоЭлементаЛево=ПоложениеПервогоЭлементаЛево + ШиринаПоля + ШиринаЗаголовка + РасстояниеМеждуЭлементами+10;	
			//		ЭтаФорма.Ширина = ЭтаФорма.Ширина + ШиринаПоля + РасстояниеМеждуЭлементами;
			//		//ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Ширина=ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Ширина + ШиринаПоля + РасстояниеМеждуЭлементами;
			//	КонецЕсли;
			//	
			//	
			//КонецЦикла;
			//
			//ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница=ТекСтраница;		
			////Исключение
			////	Сообщить(ОписаниеОшибки());
			////КонецПопытки;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Функция ПолучитьПредставлениеЗаголовкаСкидки(Объект) Экспорт
	
	Если Объект.ЭтоНовый() Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			НЗ=РегистрыСведений.тт_СкидкиНаАвтомобиль.СоздатьНаборЗаписей();
			НЗ.Отбор.Объект.Установить(Объект.ДокументОснование);
			НЗ.Прочитать();
			Если НЗ.Количество() > 0 Тогда
				СуммаСкидок=0;
				
				Для каждого Зап из НЗ Цикл
					Если НЕ Зап.Одобрено Тогда КонецЕсли;
					СуммаСкидок=СуммаСкидок+Зап.СуммаСкидки;
				КонецЦикла;
				
				Возврат "Сумма скидки: "+СуммаСкидок+" руб.";
			Иначе
				Возврат "Установка скидок (не установлены)";
			КонецЕсли;
		КонецЕсли;
		Возврат "Установка скидок (не установлены)";
	КонецЕсли;

	НЗ=РегистрыСведений.тт_СкидкиНаАвтомобиль.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(Объект.Ссылка);
	НЗ.Прочитать();
	
	СуммаСкидок=0;
	
	Для каждого Зап из НЗ Цикл
		Если НЕ Зап.Одобрено Тогда Продолжить КонецЕсли;
		СуммаСкидок=СуммаСкидок+Зап.СуммаСкидки;
	КонецЦикла;
	
	Возврат "Сумма скидки: "+СуммаСкидок+" руб.";
	
КонецФункции

Процедура ЗаписатьДополнительныеРеквизиты(ЭтаФорма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенияСвойствОбъектовВидыСвойств.Свойство,
	|	НазначенияСвойствОбъектовВидыСвойств.Свойство.ТипЗначения КАК ТипЗначения,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	ПланВидовХарактеристик.НазначенияСвойствОбъектов.ВидыСвойств КАК НазначенияСвойствОбъектовВидыСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО НазначенияСвойствОбъектовВидыСвойств.Свойство = ЗначенияСвойствОбъектов.Свойство
	|			И (ЗначенияСвойствОбъектов.Объект = &Объект)
	|ГДЕ
	|	НазначенияСвойствОбъектовВидыСвойств.Ссылка = &Ссылка
	|	И НазначенияСвойствОбъектовВидыСвойств.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НазначенияСвойствОбъектовВидыСвойств.Свойство.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", ПланыВидовХарактеристик.НазначенияСвойствОбъектов.НайтиПоНаименованию(ЭтаФорма.ЭтотОбъект.Метаданные().Синоним));
	Запрос.УстановитьПараметр("Объект", ЭтаФорма.ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элемент=ЭтаФорма.ЭлементыФормы.Найти("Свойство_"+ВыборкаДетальныеЗаписи.Свойство.Код);
		
		Если Элемент <>Неопределено
			И НЕ обЗначениеНеЗаполнено(Элемент.Значение) 
			И ВыборкаДетальныеЗаписи.Значение <> Элемент.Значение Тогда
			
			РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			РС.Объект=ЭтаФорма.ЭтотОбъект.Ссылка;
			РС.Свойство=ВыборкаДетальныеЗаписи.Свойство;
			РС.Значение=Элемент.Значение;
			РС.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаНажатияКнопки(Кнопка, ЭтаФорма, Ссылка) Экспорт
	
	Если Кнопка.Имя="УстановкаСкидок" Тогда
		РасчетСкидокЗаказНаАвтомобиль(ЭтаФорма.ЭтотОбъект, ЭтаФорма)
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетСкидокЗаказНаАвтомобиль(ЭтотОбъект, ФормаВладелец)
	
	Если ЭтотОбъект.Ссылка.Пустая() ИЛИ ФормаВладелец.Модифицированность Тогда
		Сообщить("Перед расчетом скидок следует записать документ!");
		Возврат;
	КонецЕсли;
	
	
	обРасчетСкидок = Обработки.тт_РасчетСкидокЗаказНаАвтомобиль.Создать();
	обРасчетСкидок.Ссылка = ЭтотОбъект.Ссылка;
	ФормаСкидок = обРасчетСкидок.ПолучитьФорму("Форма", ФормаВладелец);
	ФормаСкидок.Заголовок = "Установка скидок "+ЭтотОбъект.Ссылка;
	
	РС=РегистрыСведений.тт_СкидкиНаАвтомобиль.СоздатьНаборЗаписей();
	РС.Отбор.Объект.Установить(ЭтотОбъект.Ссылка);
	РС.Прочитать();
	
	Если РС.Количество()=0 Тогда
		//Заполним скидками  , если есть рабочий лист, перенесем скидки из него
		//Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ДокументОснование) И ТипЗнч(ЭтотОбъект.Ссылка.ДокументОснование)=Тип("ДокументСсылка.РабочийЛист") Тогда
		//	ЗаполнитьСкидкамиИзРегистра(ФормаСкидок.ЭлементыФормы.Скидки.Значение, ЭтотОбъект.Ссылка.ДокументОснование);		
		//КонецЕсли;
		//
		ДоПолнитьСкидкамиПоУмолчанию(обРасчетСкидок.Скидки, ЭтотОбъект.Ссылка);
		
	Иначе //Заполним скидки из регистра
		
		ЗаполнитьСкидкамиИзРегистра(обРасчетСкидок.Скидки, ЭтотОбъект.Ссылка);			

	КонецЕсли;
	
	//ТЧПоказателей = ФормаСкидок.Показатели;
	//
	//ТЧСкидок = Новый ТаблицаЗначений;
	//ТЧСкидок.Колонки.Добавить("Родитель");
	//ТЧСкидок.Колонки.Добавить("Скидка");
	//ТЧСкидок.Колонки.Добавить("СуммаСкидки");
	//ТЧСкидок.Колонки.Добавить("СуммаВозмещения");
	//ТЧСкидок.Колонки.Добавить("Одобрено");
	//	
	//	
	ФормаСкидок.ОткрытьМодально();
КонецПроцедуры

Процедура ДоПолнитьСкидкамиПоУмолчанию(Скидки, СсылкаНаОбъект) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТипыСкидокНаАвтомобиль.Ссылка КАК Скидка,
	//|	ВЫБОР
	//|		КОГДА ТипыСкидокНаАвтомобиль.МаркетинговаяПрограмма = 1
	//|			ТОГДА ЕСТЬNULL(ТипыСкидокНаАвтомобиль.СкидкаПоПрограмме, 0)
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СуммаСкидки,
	//|	ТипыСкидокНаАвтомобиль.ПорогСкидки КАК Порог,
	//|	ТипыСкидокНаАвтомобильМодели.Модель,
	//|	ТипыСкидокНаАвтомобиль.МаркетинговаяПрограмма,
	//|	ЕСТЬNULL(ТипыСкидокНаАвтомобиль.СуммаВозмещения, 0) КАК СуммаВозмещения
	//|ИЗ
	//|	Справочник.ТипыСкидокНаАвтомобиль КАК ТипыСкидокНаАвтомобиль
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыСкидокНаАвтомобиль.Модели КАК ТипыСкидокНаАвтомобильМодели
	//|		ПО (ТипыСкидокНаАвтомобильМодели.Ссылка = ТипыСкидокНаАвтомобиль.Ссылка)
	//|ГДЕ
	//|	ТипыСкидокНаАвтомобиль.Организация = &Организация
	//|	И ТипыСкидокНаАвтомобиль.ПометкаУдаления = ЛОЖЬ
	//|	И ТипыСкидокНаАвтомобиль.ДатаНачала <= &ДатаДок
	//|	И ТипыСкидокНаАвтомобиль.ДатаОкончания >= &ДатаДок
	//|	И ТипыСкидокНаАвтомобиль.ЭтоГруппа = ЛОЖЬ";
	//
	//Запрос.УстановитьПараметр("ДатаДок", СсылкаНаОбъект.Дата);
	//Запрос.УстановитьПараметр("Модель", СсылкаНаОбъект.Модель);
	//Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
	//
	//ТабСкидок = Запрос.Выполнить().Выгрузить();
	//
	//ЕстьПрограмма = Ложь;
	//
	//Для каждого Стр из ТабСкидок Цикл
	//	Если Стр.Модель = NULL Тогда Продолжить КонецЕсли;
	//	
	//	НайденнаяСкидка=Скидки.Найти(Стр.Скидка,"Скидка");
	//	Если НайденнаяСкидка = Неопределено Тогда
	//		Если Стр.МаркетинговаяПрограмма=1 Тогда
	//			ЕстьПрограмма=Истина;
	//		КонецЕсли;	
	//			
	//		Если  СсылкаНаОбъект.Модель = Стр.Модель ИЛИ СсылкаНаОбъект.Модель.ПринадлежитЭлементу(Стр.Модель) Тогда
	//			НовСтр=Скидки.Добавить();
	//			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Если Не ЕстьПрограмма Тогда
	//	
	//	НовСтр=Скидки.Добавить();
	//	НовСтр.Скидка = Справочники.ТипыСкидокНаАвтомобиль.ОтчетБезВозмещения;
	//	НовСтр.Одобрено = ИСТИНА;
	//	НовСтр.СуммаСкидки=0;
	//	НовСтр.СуммаВозмещения=0;
	//	
	//КонецЕсли;
	
   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыСкидок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыСкидокНаАвтомобиль КАК ТипыСкидок
	|ГДЕ
	|	(ТипыСкидок.Родитель = &ГруппаСкидокВольво
	|			ИЛИ ТипыСкидок.Родитель = &ГруппаСкидокОПА)
	|	И НЕ ТипыСкидок.ПометкаУдаления
	|	И НЕ ТипыСкидок.ЭтоГруппа";
	Запрос.УстановитьПараметр("ГруппаСкидокВольво", Справочники.ТипыСкидокНаАвтомобиль.НайтиПоКоду("00006"));
	Запрос.УстановитьПараметр("ГруппаСкидокОПА", Справочники.ТипыСкидокНаАвтомобиль.НайтиПоКоду("01134"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// БИЗТЕХ КОВАЛЬ 05.06.2024 ++
		//Проверим есть ли условия для скидки
		Если ВыборкаДетальныеЗаписи.Ссылка.Модели.Количество() > 0 Тогда
				Показывать = Ложь;
				//Проверим по очереди каждый родитель
				Для Каждого Родитель из ВыборкаДетальныеЗаписи.Ссылка.Модели Цикл 
					Если ЗначениеЗаполнено(СсылкаНаОбъект.Автомобиль.Модель) И ТипЗнч(Родитель.Модель) = Тип("СправочникСсылка.Модели") Тогда
						Если СсылкаНаОбъект.Автомобиль.Модель.ПринадлежитЭлементу(Родитель.Модель) Тогда
							Показывать = Истина;
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗаполнено(СсылкаНаОбъект.Автомобиль.БТ_МаркаАвто) И ТипЗнч(Родитель.Модель) = Тип("СправочникСсылка.БТ_МаркиАвтомобилей")
						И СсылкаНаОбъект.Автомобиль.БТ_МаркаАвто = Родитель.Модель Тогда
							Показывать = Истина;
					КонецЕсли;
				КонецЦикла;
				Если Показывать Тогда
					НовСтр=Скидки.Добавить();
					НовСтр.Скидка = ВыборкаДетальныеЗаписи.Ссылка;
					НовСтр.Одобрено = ИСТИНА;
					НовСтр.СуммаСкидки=0;
					НовСтр.СуммаВозмещения=0;	
				КонецЕсли;
			
		Иначе
			НовСтр=Скидки.Добавить();
			НовСтр.Скидка = ВыборкаДетальныеЗаписи.Ссылка;
			НовСтр.Одобрено = ИСТИНА;
			НовСтр.СуммаСкидки=0;
			НовСтр.СуммаВозмещения=0;	
		КонецЕсли;	
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьСкидкамиИзРегистра(Скидки, СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тт_СкидкиНаАвтомобиль.Скидка,
	|	тт_СкидкиНаАвтомобиль.СуммаСкидки,
	|	тт_СкидкиНаАвтомобиль.СуммаВозмещения,
	|	тт_СкидкиНаАвтомобиль.Одобрено,
	|	тт_СкидкиНаАвтомобиль.Скидка.ПорогСкидки КАК Порог
	|ИЗ
	|	РегистрСведений.тт_СкидкиНаАвтомобиль КАК тт_СкидкиНаАвтомобиль
	|ГДЕ
	|	тт_СкидкиНаАвтомобиль.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Скидки.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
//----ПРОЦЕДУРЫ РАБОТЫ С ФОРМОЙ--Конец--


//----Функции общего назначения--Начало--

Функция ПолучитьОстаткиВозмещений(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТТ_ОстаткиВозмещенийОстатки.СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТТ_ОстаткиВозмещений.Остатки(, Автомобиль = &Автомобиль) КАК ТТ_ОстаткиВозмещенийОстатки
	|ГДЕ
	|	ЕСТЬNULL(ТТ_ОстаткиВозмещенийОстатки.СуммаОстаток, 0) <> 0";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат ?(Выборка.Сумма=Null,0,Выборка.Сумма);
	КонецЦикла;
	
	Возврат 0;

КонецФункции

Функция ПолучитьВозмещения(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТТ_ОстаткиВозмещенийОбороты.СуммаРасход) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТТ_ОстаткиВозмещений.Обороты(, , , Автомобиль = &Автомобиль) КАК ТТ_ОстаткиВозмещенийОбороты
	|ГДЕ
	|	ЕСТЬNULL(ТТ_ОстаткиВозмещенийОбороты.СуммаРасход,0) <> 0";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат ?(Выборка.Сумма=Null,0,Выборка.Сумма);
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьСписокДоступныхПодразделений(Пользователь) Экспорт
	
	СпЗнач=Новый СписокЗначений;
	
	РС=РегистрыСведений.ДоступКПодразделениям.СоздатьНаборЗаписей();
	РС.Отбор.ШаблонПрав.Установить(Пользователь);
	РС.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&ГруппаПодразделений)";
	
	
	Для Каждого Зап Из РС Цикл
		
		Если ТипЗнч(Зап.Подразделение) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда		
			
			Запрос.УстановитьПараметр("ГруппаПодразделений", Зап.Подразделение);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СпЗнач.Добавить(ВыборкаДетальныеЗаписи.Ссылка);		
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Зап.Подразделение)	= Тип("СправочникСсылка.ГруппыДоступаКПодразделениям") Тогда
			
			Для Каждого Стр Из Зап.Подразделение.Подразделения Цикл
				
				Запрос.УстановитьПараметр("ГруппаПодразделений", Стр.ПодразделениеКомпании);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СпЗнач.Добавить(ВыборкаДетальныеЗаписи.Ссылка);		
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СпЗнач;
	
КонецФункции

Функция ПолучитьБрэнд(Элемент) Экспорт
	
	Если Элемент.Родитель.Пустая() Тогда
		Возврат Элемент;
	Иначе
		Возврат ПолучитьБрэнд(Элемент.Родитель);
	КонецЕсли;
	
КонецФункции

Функция обПолучитьФИОСокр(Знач ФИОПолное) Экспорт
	
	ФИОПолное = СокрЛП(ФИОПолное);	
	ПозицияПробела = Найти(ФИОПолное, " ");
	
	Если ПозицияПробела = 0 Тогда
		Возврат ФИОПолное;	
	КонецЕсли;
	
	Фамилия = Лев(ФИОПолное,ПозицияПробела);
	
	ИмяОтчество = Сред(ФИОПолное, ПозицияПробела+1, СтрДлина(ФИОПолное) - ПозицияПробела);
	СтрокаВыход =  Фамилия+Лев(ИмяОтчество,1)+".";
	ПозицияПробела2 = Найти(ИмяОтчество, " ");
	
	Если ПозицияПробела2 = 0 Тогда
		Возврат СтрокаВыход;	
	КонецЕсли;
	
	Отчество =  Сред(ИмяОтчество, ПозицияПробела2+1, СтрДлина(ИмяОтчество) - ПозицияПробела2);
	
	Возврат СтрокаВыход+Лев(Отчество,1)+".";
	
КонецФункции

Функция ПолучитьПланДатуВыдачи(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.ПланируемаяДатаВыдачиАвтомобиля
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ПометкаУдаления = ЛОЖЬ
		|	И Событие.ВидСобытия = &ВидСобытия
		|	И Событие.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Формат(ВыборкаДетальныеЗаписи.ПланируемаяДатаВыдачиАвтомобиля,"ДФ=dd.MM.yyyy");	
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция НаличиеПТС(Автомобиль) Экспорт
	
	ТехПаспорт = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
	
	Если ТехПаспорт <> Неопределено Тогда
		Возврат "ПТС";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИнформациюПартииАвтомобиля(Автомобиль) Экспорт
	
	ПараметрыПартии=Новый Структура;
	ПараметрыПартии.Вставить("Поставщик", "");
	ПараметрыПартии.Вставить("СебестоимостьПоступления", "");	
	ПараметрыПартии.Вставить("ВхДокНомер", "");	
	ПараметрыПартии.Вставить("ВхДокДата", "");	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Партия.Контрагент КАК Поставщик,
	|	СУММА(ОстаткиАвтомобилейОстатки.СуммаОстаток) КАК СебестоимостьПоступления,
	|	ЕСТЬNULL(СчетФактураПолученный.ВхДокНомер, """") КАК ВхДокНомер,
	|	ЕСТЬNULL(СчетФактураПолученный.ВхДокДата, """") КАК ВхДокДата
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО (ОстаткиАвтомобилейОстатки.Партия = СчетФактураПолученный.ДокументОснование)
	|			И (СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ)
	|			И (СчетФактураПолученный.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Партия.Контрагент,
	|	ЕСТЬNULL(СчетФактураПолученный.ВхДокНомер, """"),
	|	ЕСТЬNULL(СчетФактураПолученный.ВхДокДата, """")";
	
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПартии,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат ПараметрыПартии;
	
КонецФункции
	
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции    

Функция ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, Объект, ИмяТабЧасти) Экспорт
	
	МетаданныеДокумента= Объект.Метаданные();
	
	ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);
	
	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;
		
	Иначе
		Возврат НЕ (ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено);	
	КонецЕсли;

КонецФункции // ЕстьРеквизитТабЧастиДокум ента()

Функция ВнутрКонтрагент(Контр) Экспорт
	Если Контр=Справочники.Контрагенты.НайтиПоКоду("ЦБ000447")//INT_SERV
		ИЛИ Контр=Справочники.Контрагенты.НайтиПоКоду("ЦБ043484") //INT_SERV  ИП
		ИЛИ Контр=Справочники.Контрагенты.НайтиПоКоду("ЦБ022077") //INT_SERV  ИП		
		ИЛИ Контр=Справочники.Контрагенты.НайтиПоКоду("ЦБ230421") //INT_SERV  ИП		
		Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Значение = &Значение
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Значение", Контр);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Контрагент-организация"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	

КонецФункции

//<<Павличенко 11.07.2020
//ТЗ Документооборот Холдинга Авто
Функция ПолучитьДанные_СписокПараметров_ТТ(ЗначениеПараметра, Организация)
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ЗначениеПараметра", ЗначениеПараметра);
	ПараметрыОтбора.Вставить("Параметр1", Организация);
	
	СтруктураД = Новый Структура;
	ЭлементСпр = Справочники.тт_СписокПараметров.НайтиПоКоду("000013700"); //для авто
	МассивСтрок = ЭлементСпр.СписокПараметров.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() = 0 тогда
		сообщить("Обратитесь к программисту! Для вида операции " + ЗначениеПараметра + " не задано соответствие данных в справочнике Список_Параметров_ТТ, код 000013700. Невозможно узнать договор, склад, подразделение документа поступления!Документ поступления товаров не может быть создан!");
		Возврат СтруктураД;
	КонецЕсли;
	СтруктураД.Вставить("Параметр2", МассивСтрок[0].Параметр2);
	СтруктураД.Вставить("Параметр3", МассивСтрок[0].Параметр3);
	
	Если ЗначениеПараметра = "ПередачаКомиссия" тогда
		СтруктураД.Вставить("Параметр4", МассивСтрок[0].Параметр4);
		СтруктураД.Вставить("Параметр5", МассивСтрок[0].Параметр5);
	КонецЕсли;
	Возврат СтруктураД;
КонецФункции

Функция ПроверкаТрейдИН_ТрейдИНКОМ(Склад)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Склад);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02121"));  //категория склада
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КатегорияСклада = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КатегорияСклада = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Если КатегорияСклада = Неопределено тогда
		сообщить("Не установлена категория склада для " + Склад + "! Документ не будет создан!");
		Возврат Неопределено;
	КонецЕсли;
	Если КатегорияСклада = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Трейд-ин") тогда
		Возврат Ложь; 
	ИначеЕсли КатегорияСклада = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Трейд-ин ком") тогда
		Возврат Истина; 
	Иначе
		Сообщить("Категория склада для " + Склад + " выбрана " + КатегорияСклада + "! Это не трейд ин! Для нее невозможно определить склад документа-приемника!!");
		Возврат Неопределено; 

	КонецЕсли;
КонецФункции

Процедура ОбработатьДокументХолдинга (ДокументИсточникОбъект, ВидОперации) Экспорт
	
	ИмяДокумента=ДокументИсточникОбъект.Метаданные().Имя;

	ДокументПриемник_Объект = ПолучитьДокументПриемник(ДокументИсточникОбъект.Ссылка, ВидОперации);
	
	ТекстСообщения = ?(ДокументПриемник_Объект.ЭтоНовый(), "Создан и проведен ", "Изменен и проведен ");
	
	Если ИмяДокумента="РеализацияАвтомобилей" и (ВидОперации = "ПередачаКомиссия" ИЛИ ВидОперации = "Передача") Тогда     //поступление авто
		
		 ДокументПриемник_Объект.Дата = ДокументИсточникОбъект.Дата + 1;
		 ДокументПриемник_Объект.Автор = ПараметрыСеанса.Пользователь;
		 
		 
		 Если ВидОперации = "ПередачаКомиссия" тогда
			 ДокументПриемник_Объект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия;
			 ДокументПриемник_Объект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "2311093925");  //Темп Авто Кубань
			 ДокументПриемник_Объект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ДокументИсточникОбъект.Организация.ИНН);
			 СтрукВозв = ПолучитьДанные_СписокПараметров_ТТ(ВидОперации, ДокументПриемник_Объект.Организация);
			 ДокументПриемник_Объект.ПодразделениеКомпании = СтрукВозв.Параметр3; //Трейд-ин ТАК
			 
			 ТрейдИНКОМ = ПроверкаТрейдИН_ТрейдИНКОМ(ДокументИсточникОбъект.СкладКомпании);
			 Если  ТрейдИНКОМ = Неопределено тогда
				 сообщить("Обработка завершена с ошибкой! Не найдена категория склада");
				 Возврат;
			 КонецЕсли;
			 
			 ДокументПриемник_Объект.СкладКомпании = ?(ТрейдИНКОМ = Истина, СтрукВозв.Параметр5, СтрукВозв.Параметр4); 	
			 
			 ДокументПриемник_Объект.ВхДокНомер = ДокументИсточникОбъект.Номер; 	
			 ДокументПриемник_Объект.ВхДокДата = ДокументИсточникОбъект.Дата; 	
	
			 ДокументПриемник_Объект.ДоговорВзаиморасчетов = НайтиДоговор(ДокументПриемник_Объект, Перечисления.ВидыДоговоров.СКомитентом);
		 Иначе //Передача
			 ДокументПриемник_Объект.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилей;
			 ДокументПриемник_Объект.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", СокрЛП(ДокументИсточникОбъект.Контрагент.ИНН));  //
			 СтрукВозв = ПолучитьДанные_СписокПараметров_ТТ(ВидОперации, ДокументПриемник_Объект.Организация);
			 ДокументПриемник_Объект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ДокументИсточникОбъект.Организация.ИНН);
			 ДокументПриемник_Объект.ПодразделениеКомпании = СтрукВозв.Параметр3; //
			 ДокументПриемник_Объект.СкладКомпании = СтрукВозв.Параметр2; //	
			 
			 ДокументПриемник_Объект.ВхДокНомер = ДокументИсточникОбъект.Номер; 	
			 ДокументПриемник_Объект.ВхДокДата = ДокументИсточникОбъект.Дата; 	
			 
			 ДокументПриемник_Объект.ДоговорВзаиморасчетов = НайтиДоговор(ДокументПриемник_Объект, Перечисления.ВидыДоговоров.Покупка);
		 КонецЕсли;
		 
		ДокументПриемник_Объект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		ДокументПриемник_Объект.ВалютаДокумента = ДокументИсточникОбъект.ВалютаДокумента;
		ДокументПриемник_Объект.КурсВалютыВзаиморасчетов = ДокументИсточникОбъект.КурсВалютыВзаиморасчетов;
		ДокументПриемник_Объект.КурсВалютыУПР = ДокументИсточникОбъект.КурсВалютыУПР;
		ДокументПриемник_Объект.КурсДокумента = ДокументИсточникОбъект.КурсДокумента;

		ДокументПриемник_Объект.Автомобили.Очистить();
		 
		 Для Каждого ТекСтрока Из ДокументИсточникОбъект.Ссылка.Автомобили Цикл
			 СтрокаАвтомобиля = ДокументПриемник_Объект.Автомобили.Добавить();
			 Если СтрокаАвтомобиля <> Неопределено Тогда
				 СтрокаАвтомобиля.Автомобиль = ТекСтрока.Автомобиль;
				 ДокументПриемник_Объект.ОбработкаРеквизита("Автомобили.Автомобиль", СтрокаАвтомобиля);
				 СтрокаАвтомобиля.ИдентификаторАвтомобиля=Новый УникальныйИдентификатор;
				 СтрокаАвтомобиля.VIN = ТекСтрока.Автомобиль.VIN;
				 СтрокаАвтомобиля.Количество = ТекСтрока.Количество;
				 СтрокаАвтомобиля.Цена = ТекСтрока.Цена;
				 СтрокаАвтомобиля.Сумма = ТекСтрока.Сумма;
				 СтрокаАвтомобиля.СуммаВсего = ТекСтрока.СуммаВсего;
				 СтрокаАвтомобиля.СтавкаНДС = ТекСтрока.СтавкаНДС;
				 СтрокаАвтомобиля.СуммаНДС = ТекСтрока.СуммаНДС;
				 СтрокаАвтомобиля.АвтомобильБУ = ?(ВидОперации = "ПередачаКомиссия", Истина, Ложь);
				 СтрокаАвтомобиля.АвтомобильБезЗаказа = Истина;
			 КонецЕсли;
		 КонецЦикла;
		 
		 ДокументПриемник_Объект.Комментарий = "Заполнен автоматически при проведении " + ДокументИсточникОбъект + " (" + ТекущаяДата() + ")"; 
		 ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.Проведение);
		 
		 Если ВидОперации = "Передача" тогда
			 Запрос = Новый Запрос;
			 Запрос.Текст = 
			 "ВЫБРАТЬ
			 |	СчетФактураПолученный.Ссылка
			 |ИЗ
			 |	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			 |ГДЕ
			 |	СчетФактураПолученный.ДокументОснование = &ДокументОснование
			 |	И СчетФактураПолученный.Проведен = &Проведен";
			 
			 Запрос.УстановитьПараметр("ДокументОснование", ДокументПриемник_Объект.Ссылка);
			 Запрос.УстановитьПараметр("Проведен", Истина);
			 
			 ТЗ = Запрос.Выполнить().Выгрузить();
			 
			 Если ТЗ.Количество() = 0 тогда
				 СчетФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();
			 Иначе
				 СчетФактураПолученный = ТЗ[0].Ссылка.ПолучитьОбъект();
			 КонецЕсли;
			 
			 ТекстСообщенияСФ =  ?(СчетФактураПолученный.ЭтоНовый(), "Создан и проведен ", "Изменен и проведен ");
			 
			 //Заполняем созданный документ (реквизиты документа заполняются значениями, которые совпадают по именам реквизитов)
			 СчетФактураПолученный.Заполнить(ДокументПриемник_Объект.Ссылка); 
			 СчетФактураПолученный.ВхДокНомер = ДокументПриемник_Объект.ВхДокНомер; 	
			 СчетФактураПолученный.ВхДокДата = ДокументПриемник_Объект.ВхДокДата; 	

			 СчетФактураПолученный.Комментарий = "Заполнен автоматически при проведении " + ДокументИсточникОбъект + " (" + ТекущаяДата() + ")";
			 //Записываем созданный документ
			 СчетФактураПолученный.Дата = ДокументИсточникОбъект.Дата + 1;
			 СчетФактураПолученный.Записать(РежимЗаписиДокумента.Проведение,); 
			 
			 ДокументПриемник_Объект.ВхДокНомер = СчетФактураПолученный.Номер; 	
			 ДокументПриемник_Объект.ВхДокДата = СчетФактураПолученный.Дата; 	
		 	ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.Запись);
		 КонецЕсли;
		 
		 ФормаДок = ДокументПриемник_Объект.ПолучитьФорму("ФормаДокумента");
		 ФормаДок.Открыть();
		 
		 НаборЗаписей = РегистрыСведений.ТТ_СоответствиеДокументовМеждуХолдингом.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ДокументИсточник.Установить(ДокументИсточникОбъект.Ссылка);
		 НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
		 
		 НоваяЗапись = НаборЗаписей.Добавить(); 
		 НоваяЗапись.ДокументИсточник = ДокументИсточникОбъект.Ссылка; 
		 НоваяЗапись.ВидОперации = ВидОперации; 
		 НоваяЗапись.ДокументПриемник = ДокументПриемник_Объект.Ссылка; 
		 
		 НаборЗаписей.Записать();

		 сообщить(ТекстСообщения + ДокументПриемник_Объект);
		 Если ВидОперации = "Передача" тогда
			 сообщить (ТекстСообщенияСФ + СчетФактураПолученный);
		 КонецЕсли;
	ИначеЕсли ИмяДокумента = "ВозвратПоставщикуАвтомобилей" И ВидОперации = "ВозвратКомиссия" Тогда	  //возврат авто поставщику  комиссия
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	АвтомобилиОтданныеОстаткиИОбороты.Регистратор,
		|	АвтомобилиОтданныеОстаткиИОбороты.КоличествоПриход,
		|	АвтомобилиОтданныеОстаткиИОбороты.СуммаПриход,
		|	АвтомобилиОтданныеОстаткиИОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.АвтомобилиОтданные.ОстаткиИОбороты(, &МоментВремени, Регистратор, , Автомобиль = &Автомобиль) КАК АвтомобилиОтданныеОстаткиИОбороты
		|ГДЕ
		|	АвтомобилиОтданныеОстаткиИОбороты.КоличествоПриход > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("Автомобиль", ДокументИсточникОбъект.Автомобили[0].Автомобиль);
		Запрос.УстановитьПараметр("МоментВремени", ДокументИсточникОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		РеализацияКомиссия = Неопределено;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() цикл
			РеализацияКомиссия = ВыборкаДетальныеЗаписи.Регистратор; 
			Прервать;
		КонецЦикла;
		
		Если РеализацияКомиссия = Неопределено тогда
			сообщить("Отсутствует проведенная реализация (комиссия) для автомобиля " + ДокументИсточникОбъект.Автомобили[0].Автомобиль + " на " + ДокументИсточникОбъект.Дата + "! Нужно проверить данные и повторить попытку создания документа Возврат от покупателя автомобилей!");
			Возврат;
		КонецЕсли;	

		ДокументПриемник_Объект.Заполнить(РеализацияКомиссия);
		ДокументПриемник_Объект.Дата = ДокументИсточникОбъект.Дата + 1;
		
		ДокументПриемник_Объект.Комментарий = "Заполнен автоматически при проведении " + ДокументИсточникОбъект + " (" + ТекущаяДата() + ")"; 
		ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.Проведение);
		
		
		ФормаДок = ДокументПриемник_Объект.ПолучитьФорму("ФормаДокумента");
		ФормаДок.Открыть();
		
		НаборЗаписей = РегистрыСведений.ТТ_СоответствиеДокументовМеждуХолдингом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументИсточник.Установить(ДокументИсточникОбъект.Ссылка);
		НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ДокументИсточник = ДокументИсточникОбъект.Ссылка; 
		НоваяЗапись.ВидОперации = ВидОперации; 
		НоваяЗапись.ДокументПриемник = ДокументПриемник_Объект.Ссылка; 
		
		НаборЗаписей.Записать();
		
		сообщить(ТекстСообщения + ДокументПриемник_Объект);
		//<<Павличенко 21.09.2020	
		//ИначеЕсли ИмяДокумента = "ПриходныйКассовыйОрдер" И ВидОперации = "ВзаимоЗачетСоСтраховой" Тогда	
	ИначеЕсли (ИмяДокумента = "ПриходныйКассовыйОрдер" ИЛИ ИмяДокумента = "ЧекНаОплату" ИЛИ ИмяДокумента = "Выписка") И ВидОперации = "ВзаимоЗачетСоСтраховой" Тогда
		//<<Павличенко 21.09.2020
		ДокументПриемник_Объект.Заполнить(ДокументИсточникОбъект);
		ДокументПриемник_Объект.Дата = ДокументИсточникОбъект.Дата + 1;
		
		//физ. лицо здесь кредитор, страховая дебитор
		ДокументПриемник_Объект.Кредитор = ДокументИсточникОбъект.Контрагент;
		
		//БизТех 02.11.2022г. добавлено для Реализации Фин услуг <<  
		Если ТипЗНЧ(ДокументИсточникОбъект.ДокументОснование) = ТИП("ДокументСсылка.РеализацияТоваров") 
			И ТипЗНЧ(ДокументИсточникОбъект.ДокументОснование.ДокументОснование) = ТИП("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда 
			ДокОснованиеЗамена = ДокументИсточникОбъект.ДокументОснование;
			ТЗ = ДокОснованиеЗамена.ДокументОснование.ВариантыСтрахования.Выгрузить(,"Страховщик"); 
			ДогКомитента = ДокОснованиеЗамена.ДокументОснование.ВариантыСтрахования[0].ПрограммаСтрахования.Договор; //БизТех Аляль 20.02.2025г.
			ВиСтрахования = ДокОснованиеЗамена.ДокументОснование.ВариантыСтрахования[0].ВидСтрахования;
		ИначеЕсли  ДокументИсточникОбъект.ДоговорВзаиморасчетов.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор Тогда 
			//БизТех Аляль 08.09.2025г Добавляем поиск по сделке в приоритет - там указывают Рабочий Лист <<   
			ДокРабЛистКСО = Неопределено;
			//БИЗТЕХ МАМОНОВ 06.02.2026 ++ добавил проверку на то, что это выписка т. к. в чеке и пко нет ТЧ состав
			Если ТипЗнч(ДокументИсточникОбъект) = Тип("ДокументОбъект.Выписка") И ЗначениеЗаполнено(ДокументИсточникОбъект.Состав[0].Сделка) и ТИПЗНЧ(ДокументИсточникОбъект.Состав[0].Сделка) = Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") Тогда
				ДокРабЛистКСО = ДокументИсточникОбъект.Состав[0].Сделка;
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст =  "ВЫБРАТЬ
				                |	РабочийЛистОтделаСтрахования.Ссылка КАК Ссылка,
				                |	РабочийЛистОтделаСтрахования.Страхователь КАК Страхователь
				                |ИЗ
				                |	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования
				                |ГДЕ
				                |	РабочийЛистОтделаСтрахования.Организация = &Организация
				                //|	И РабочийЛистОтделаСтрахования.ПодразделениеКомпании = &ПодразделениеКомпании
				                |	И РабочийЛистОтделаСтрахования.Страхователь = &Страхователь
				                |	И РабочийЛистОтделаСтрахования.ДоговорКСО = &ДоговорКСО
				                |	И РабочийЛистОтделаСтрахования.Проведен";
				Запрос.УстановитьПараметр("Организация", ДокументИсточникОбъект.Организация);
				//БизТех Аляль 29.07.2025г. фильтр по Подразделению убираем, т.к. часто путают. Добавим ниже проверку и оповещение
				//Запрос.УстановитьПараметр("ПодразделениеКомпании",ДокументИсточникОбъект.ПодразделениеКомпании);  
				Запрос.УстановитьПараметр("Страхователь", ДокументИсточникОбъект.Контрагент);
				Запрос.УстановитьПараметр("ДоговорКСО", ДокументИсточникОбъект.ДоговорВзаиморасчетов);
				Результат = Запрос.Выполнить().Выгрузить();
				Если Результат.Количество()>0 Тогда 
					ДокРабЛистКСО = Результат[0].Ссылка;
				КонецЕсли;
			КонецЕсли;

			Если не ДокРабЛистКСО = Неопределено Тогда
				ТЗ = ДокРабЛистКСО.ВариантыСтрахования.Выгрузить(,"Страховщик");  
				ДогКомитента = ДокРабЛистКСО.ВариантыСтрахования[0].ПрограммаСтрахования.Договор; //БизТех Аляль 24.02.2025г.  
				//БизТех Аляль 29.07.2025г. <<
				Если НЕ ДокументИсточникОбъект.ПодразделениеКомпании = ДокРабЛистКСО.ПодразделениеКомпании Тогда
					Сообщить("Внимание! Отличаются подразделения компании в документе оплаты и в Рабочем листе отдела страхования"); 
				КонецЕсли; 
				ВиСтрахования = ДокРабЛистКСО.ВариантыСтрахования[0].ВидСтрахования;
				//БизТех 29.07.2025г.
			Иначе
				Сообщить("Документ КСО не найден, автоматическое создание взаимозачета отменено.");
				Возврат;
			КонецЕсли;  
		Иначе
		//БизТех >>
		
		// БИЗТЕХ КОВАЛЬ 15.12.2025 ++ Фикс ошибки при проведении ПКО
		Попытка
			ТЗ = ДокументИсточникОбъект.ДокументОснование.ВариантыСтрахования.Выгрузить(,"Страховщик"); 
			ДогКомитента = ДокументИсточникОбъект.ДокументОснование.ВариантыСтрахования[0].ПрограммаСтрахования.Договор; //БизТех Аляль 24.02.2025г.
			ВиСтрахования = ДокументИсточникОбъект.ДокументОснование.ВариантыСтрахования[0].ВидСтрахования;
		Исключение
			Возврат;
		КонецПопытки;
		// БИЗТЕХ КОВАЛЬ 15.12.2025 --
		КонецЕсли;
		
		ТЗ.Свернуть("Страховщик");
		Если ТЗ.Количество()<>1 тогда
			сообщить ("В " + ДокументИсточникОбъект.ДокументОснование + " ошибочно введены данные! По колонке 'Страховщик' табличной части 'Варианты страхования' невозможно однозначно определить контрагента для создания взаимозачета!");
			Возврат;
		КонецЕсли;   
		//По доп оборудованию взаимозачет не нужен.
		Если ВиСтрахования = Перечисления.ВидыСтрахования.ДополнительноеОборудование Тогда
			Возврат;
		КонецЕсли;
		СтраховаяКомпания = ТЗ[0].Страховщик; 
				
		ДокументПриемник_Объект.Дебитор = СтраховаяКомпания; 

		ДокументПриемник_Объект.Комментарий = "Заполнен автоматически при проведении " + ДокументИсточникОбъект + " (" + ТекущаяДата() + ")";
		//БизТех 10.11.2022г. <<
		ДокументПриемник_Объект.ДокументОснование = ДокументИсточникОбъект.Ссылка;  
		//Если НЕ ДокументПриемник_Объект.ЭтоНовый() тогда 
		//БизТех >>
		ДокументПриемник_Объект.Состав.Очистить();
		//КонецЕсли;  
		НоваяСтрока = ДокументПриемник_Объект.Состав.Добавить();
		НоваяСтрока.ДоговорВзаиморасчетовКредитор = ДокументИсточникОбъект.ДоговорВзаиморасчетов;

		СтрукДанныхДоговор = Новый Структура();
		СтрукДанныхДоговор.Вставить("Организация",ДокументПриемник_Объект.Организация);
		СтрукДанныхДоговор.Вставить("ПодразделениеКомпании",ДокументПриемник_Объект.ПодразделениеКомпании);
		СтрукДанныхДоговор.Вставить("Контрагент",СтраховаяКомпания);
		СтрукДанныхДоговор.Вставить("Дата",ДокументПриемник_Объект.Дата);
		
		СпрЭлемент = Справочники.тт_СписокПараметров.НайтиПоНаименованию("СоответствиеДоговоровДляСтраховыхКомпаний");
		Если СпрЭлемент <> Неопределено тогда   
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("ЗначениеПараметра",СтраховаяКомпания); 
			ПараметрыОтбора.Вставить("Параметр1",ДокументПриемник_Объект.Организация); 
			ПараметрыОтбора.Вставить("Параметр2",ДокументПриемник_Объект.ПодразделениеКомпании);   
					
			НайденныеСтроки = СпрЭлемент.СписокПараметров.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 тогда
				НоваяСтрока.ДоговорВзаиморасчетовДебитор = НайтиДоговор(СтрукДанныхДоговор, Перечисления.ВидыДоговоров.Продажа, ДогКомитента);
			Иначе
				НоваяСтрока.ДоговорВзаиморасчетовДебитор = НайденныеСтроки[0].Параметр3;
			КонецЕсли; 
		Иначе
			НоваяСтрока.ДоговорВзаиморасчетовДебитор = НайтиДоговор(СтрукДанныхДоговор, Перечисления.ВидыДоговоров.Продажа);
		КонецЕсли;
		
		Если ДокументИсточникОбъект.ХозОперация = Справочники.ХозОперации.ЧекНаОплатуВозврат Тогда
			ДокументПриемник_Объект.Кредитор = СтраховаяКомпания; 
			ДокументПриемник_Объект.Дебитор = ДокументИсточникОбъект.Контрагент;                                
			НоваяСтрока.ДоговорВзаиморасчетовКредитор = НоваяСтрока.ДоговорВзаиморасчетовДебитор;
			НоваяСтрока.ДоговорВзаиморасчетовДебитор = ДокументИсточникОбъект.ДоговорВзаиморасчетов;
        КонецЕсли;
		
		НоваяСтрока.КурсВалютыДоговораДебитора = обКурсДляВалюты(НоваяСтрока.ДоговорВзаиморасчетовДебитор, ДокументПриемник_Объект.Дата);
		НоваяСтрока.КурсВалютыДоговораКредитора = обКурсДляВалюты(НоваяСтрока.ДоговорВзаиморасчетовКредитор, ДокументПриемник_Объект.Дата);
		
		НоваяСтрока.СделкаКредитор = ДокументИсточникОбъект.Ссылка;    //ПКО. физик  
		//БизТех 10.11.2022г.<<
		Если ИмяДокумента = "Выписка" Тогда
            НоваяСтрока.СделкаДебитор = ДокРабЛистКСО;
			НоваяСтрока.Сумма = ДокументИсточникОбъект.СуммаДокументаПриход;  
		ИначеЕсли ДокументИсточникОбъект.ХозОперация = Справочники.ХозОперации.ЧекНаОплатуВозврат Тогда
            НоваяСтрока.СделкаДебитор = ДокументИсточникОбъект.Ссылка;   
			НоваяСтрока.СделкаКредитор = ДокументИсточникОбъект.ДокументОснование;  
			НоваяСтрока.Сумма = ДокументИсточникОбъект.СуммаДокумента; 
		Иначе   
		//БизТех 10.11.2022г.>>
			НоваяСтрока.СделкаДебитор = ДокументИсточникОбъект.ДокументОснование;   //страховая компания, раб лист
			НоваяСтрока.Сумма = ДокументИсточникОбъект.СуммаДокумента; 
		КонецЕсли;  
				
		//ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.Запись);
		//сообщить(ДокументПриемник_Объект.ссылка);
		Попытка 	
			ДокументПриемник_Объект.УстановитьНовыйНомер();
			//ДокументПриемник_Объект.обменДанными.Загрузка = Истина;
			ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.Проведение);  
			//ДокументПриемник_Объект.Записать();  
			
			
			
		Исключение 
			
			ДокументПриемник_Объект.Записать();
			
		КонецПопытки;
		
		//ФормаДок = ДокументПриемник_Объект.ПолучитьФорму("ФормаДокумента");
		//ФормаДок.Открыть();
		
		НаборЗаписей = РегистрыСведений.ТТ_СоответствиеДокументовМеждуХолдингом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументИсточник.Установить(ДокументИсточникОбъект.Ссылка);
		НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ДокументИсточник = ДокументИсточникОбъект.Ссылка; 
		НоваяЗапись.ВидОперации = ВидОперации; 
		НоваяЗапись.ДокументПриемник = ДокументПриемник_Объект.Ссылка; 
		
		НаборЗаписей.Записать();
		
		сообщить(ТекстСообщения + ДокументПриемник_Объект);

	//>>Павличенко 17.09.2020	
	КонецЕсли;	
КонецПроцедуры

//<<Павличенко 17.09.2020
Процедура ОтменитьДокументХолдинга(ДокументИсточникОбъект, ВидОперации) Экспорт
	
	ИмяДокумента=ДокументИсточникОбъект.Метаданные().Имя;
	
	ДокументПриемник_Объект = ПолучитьДокументПриемник(ДокументИсточникОбъект.Ссылка, ВидОперации);
	
	ТекстСообщения = "Отменено проведение документа ";
	
	Если ЗначениеЗаполнено(ДокументПриемник_Объект.Ссылка) Тогда
		ДокументПриемник_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		сообщить(ТекстСообщения + ДокументПриемник_Объект);
	КонецЕсли;

КонецПроцедуры	
//>>Павличенко 17.09.2020	

Функция ПолучитьДокументПриемник_ТиповыеРегистры(ДокументИсточник,ВидОперации)
	Если Найти(ВидОперации, "Передача")>0 тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Ссылка КАК СсылкаИсточник,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Ссылка КАК СсылкаПриемник
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|		ПО РеализацияАвтомобилейАвтомобили.Автомобиль = ПоступлениеАвтомобилейАвтомобили.Автомобиль
		|			И РеализацияАвтомобилейАвтомобили.Ссылка.Организация <> ПоступлениеАвтомобилейАвтомобили.Ссылка.Организация
		|			И (НАЧАЛОПЕРИОДА(РеализацияАвтомобилейАвтомобили.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата, ДЕНЬ))
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Ссылка = &ДокументИсточник
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Номер";
		Запрос.УстановитьПараметр("ДокументИсточник", ДокументИсточник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.СсылкаПриемник.ПолучитьОбъект();
		Иначе Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли  Найти(ВидОперации, "Возврат")>0 тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка.Ссылка КАК СсылкаИсточник,
		|	ВозвратОтПокупателяАвтомобилейАвтомобили.Ссылка.Ссылка КАК СсылкаПриемник
		|ИЗ
		|	Документ.ВозвратПоставщикуАвтомобилей.Автомобили КАК ВозвратПоставщикуАвтомобилейАвтомобили
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратОтПокупателяАвтомобилей.Автомобили КАК ВозвратОтПокупателяАвтомобилейАвтомобили
		|		ПО ВозвратПоставщикуАвтомобилейАвтомобили.Автомобиль = ВозвратОтПокупателяАвтомобилейАвтомобили.Автомобиль
		|			И ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка.Организация <> ВозвратОтПокупателяАвтомобилейАвтомобили.Ссылка.Организация
		|			И (НАЧАЛОПЕРИОДА(ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВозвратОтПокупателяАвтомобилейАвтомобили.Ссылка.Дата, ДЕНЬ))
		|ГДЕ
		|	ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка.Ссылка = &ДокументИсточник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратОтПокупателяАвтомобилейАвтомобили.Ссылка.Ссылка,
		|	ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка.Ссылка";	
		Запрос.УстановитьПараметр("ДокументИсточник", ДокументИсточник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.СсылкаПриемник.ПолучитьОбъект();
		Иначе Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьДокументПриемник(ДокументИсточник, ВидОперации) Экспорт
	
	ИмяДокумента=ДокументИсточник.Метаданные().Имя;

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументИсточник,
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументПриемник
	|ИЗ
	|	РегистрСведений.ТТ_СоответствиеДокументовМеждуХолдингом КАК ТТ_СоответствиеДокументовМеждуХолдингом
	|ГДЕ
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументИсточник = &ДокументИсточник
	|	И ТТ_СоответствиеДокументовМеждуХолдингом.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокументИсточник", ДокументИсточник);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);

	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество() = 0 тогда
		//<<со временем не нужна будет, если записи в регистре будут работать
		ДокументОбъект = ПолучитьДокументПриемник_ТиповыеРегистры(ДокументИсточник,ВидОперации);
		//>>
		Если ДокументОбъект = Неопределено тогда
			Если (ВидОперации = "Передача") ИЛИ  (ВидОперации = "ПередачаКомиссия") тогда
				ДокументОбъект = Документы.ПоступлениеАвтомобилей.СоздатьДокумент();
			КонецЕсли;
			
			Если ИмяДокумента = "ВозвратПоставщикуАвтомобилей" Тогда	
				ДокументОбъект = Документы.ВозвратОтПокупателяАвтомобилей.СоздатьДокумент();
			КонецЕсли;
			
			//<<Павличенко 24.09.2020
			Если Найти(ВидОперации, "ЗаказНаряд")>0 тогда
				ДокументОбъект = Документы.ЗаказНаряд.СоздатьДокумент();
			КонецЕсли;
			
			Если Найти(ВидОперации, "УслугиСубподряд")>0 тогда	
				ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
			КонецЕсли;
			//>>Павличенко 24.09.2020
			Если ВидОперации = "СчетНаОплатуМКУ_МА" Тогда	
				ДокументОбъект = Документы.СчетНаОплату.СоздатьДокумент();
			КонецЕсли;
			//<<Павличенко 17.09.2020
			Если ВидОперации = "ВзаимоЗачетСоСтраховой" Тогда	
				ДокументОбъект = Документы.Взаимозачет.СоздатьДокумент();
			КонецЕсли;
			//>>Павличенко 17.09.2020

		КонецЕсли;	
		Возврат ДокументОбъект;
	ИначеЕсли ТаблицаРезультат.Количество() = 1 тогда
		 Возврат ТаблицаРезультат[0].ДокументПриемник.ПолучитьОбъект();
	КонецЕсли;
КонецФункции

//<<Павличенко 21.09.2020
Функция ПолучитьДокументИсточник(ДокументПриемник, ВидОперации) Экспорт
	Рез = Неопределено;
	ИмяДокумента=ДокументПриемник.Метаданные().Имя;

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументИсточник,
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументПриемник
	|ИЗ
	|	РегистрСведений.ТТ_СоответствиеДокументовМеждуХолдингом КАК ТТ_СоответствиеДокументовМеждуХолдингом
	|ГДЕ
	|	ТТ_СоответствиеДокументовМеждуХолдингом.ДокументПриемник = &ДокументПриемник
	|	И ТТ_СоответствиеДокументовМеждуХолдингом.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("ДокументПриемник", ДокументПриемник);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);

	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультат.Следующий() цикл
		Рез = ВыборкаРезультат.ДокументИсточник;
	КонецЦикла;
	Возврат Рез;
КонецФункции
//>>Павличенко 21.09.2020

Функция ПроверкаКонтрагентХолдинга(ИсточникКонтрагент) Экспорт
	Рез = Ложь;
	Если (ИсточникКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "2312205455")) ИЛИ  // Темп Авто ФКДД 
		(ИсточникКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "2312127750")) ИЛИ // Техно-Темп
		(ИсточникКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "2311075475")) ИЛИ // Меридиан
		(ИсточникКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "2311093925")) тогда // Темп Авто Кубань
		Рез = Истина;
	КонецЕсли;	
	Возврат Рез;	
КонецФункции

Функция НайтиДоговор(Документ_ПР, ВидДоговора, ДоговорКомитента = неопределено)
	Контрагент = Документ_ПР.Контрагент;
	Организация = Документ_ПР.Организация;
	Подразделение = Документ_ПР.ПодразделениеКомпании;
	ДатаНачала = Документ_ПР.Дата;
	
	СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Вид договора ДДС");	
	СвойствоАвто = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Авто", Истина,, СвойствоДДС);

	Договор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Запрос = Новый Запрос();  
	//БизТех 10.11.2022 изменили запрос, убрали поиск по подразделению и добавили поиск по признаку Агент <<
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ДоговорыВзаиморасчетов.Ссылка,
	//|	ДоговорыВзаиморасчетов.Организация,
	//|	ДоговорыВзаиморасчетов.Подразделение,
	//|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	//|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
	//|ИЗ
	//|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	//|ГДЕ
	//|	ДоговорыВзаиморасчетов.Владелец = &Контрагент
	//|	И ДоговорыВзаиморасчетов.Организация = &Организация
	//|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	//|	И ДоговорыВзаиморасчетов.Подразделение = &Подразделение
	//|	И ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаНачала
	//|	И ДоговорыВзаиморасчетов.ПометкаУдаления = &ПометкаУдаления

	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаНачала УБЫВ"; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
	|	ДоговорыВзаиморасчетов.Организация КАК Организация,
	|	ДоговорыВзаиморасчетов.Подразделение КАК Подразделение,
	|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
	|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Контрагент
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	//|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	|	И ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаНачала
	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = &ПометкаУдаления
	|	И ДоговорыВзаиморасчетов.ПризнакАгента = &ПризнакАгента
	|	И (ДоговорыВзаиморасчетов.ДатаКонца >= &ДатаНачала
	|			ИЛИ ДоговорыВзаиморасчетов.ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала УБЫВ";
    //БизТех >>
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация); 	
	//Запрос.УстановитьПараметр("Подразделение", Подразделение); 
	Запрос.УстановитьПараметр("ПризнакАгента", Перечисления.ПризнакиАгента.Агент);  //БизТех 10.11.2022
	//Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);   
	Запрос.УстановитьПараметр("ДатКонца", ДатаНачала);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
	
	//БизТех 20.02.2025г. проверка есть ли договор в списке <<  
	Если ЗначениеЗаполнено(ДоговорКомитента) Тогда
		Результат = Запрос.Выполнить().Выгрузить(); 
		Отбор = Новый Структура ("Ссылка", ДоговорКомитента);
		СтрокаДогКомитенту = Результат.НайтиСтроки(Отбор);
		Если СтрокаДогКомитенту.Количество()<>0 Тогда
			Возврат ДоговорКомитента;
		КонецЕсли;
	КонецЕсли;
	//БизТех 20.02.2025г.>>
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл  
		Договор = Выборка.Ссылка;
		Возврат Договор;
	КонецЦикла;
	
	//БизТех 10.11.2022г. отменили создание нового договора <<
	//Договор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	//
	//Договор.УстановитьНовыйКод();
	//Договор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
	//Договор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
	//Договор.Владелец = Контрагент;
	//Договор.ВидДоговора = ВидДоговора;
	//Договор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	//Договор.Организация = Организация;
	//Договор.Подразделение = Подразделение;
	//Договор.ДляАвтосалона = Истина;
	//Договор.Комментарий = "Заполнен автоматически при проведении " + Документ_ПР + " (" + ТекущаяДата() + ")";
	////Договор.ОбработкаЗаполнения(Неопределено);
	//Договор.ДатаНачала=ДатаНачала;
	//Договор.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000005");   ///КМ - Продажа Комиссия
	//Договор.СформироватьНаименование();
	//Договор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
	////Договор.НомерДоговора=Источник.СерияПолиса+" "+Источник.НомерПолиса;
	//Договор.Записать(); 
	//
	//НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();  //Назначим договору свойство ДДС - Страхование
	//НаборЗаписей.Отбор.Объект.Установить(Договор.Ссылка);
	//НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
	//НоваяЗапись = НаборЗаписей.Добавить();
	//НоваяЗапись.Объект = Договор.Ссылка;
	//НоваяЗапись.Свойство = СвойствоДДС;
	//НоваяЗапись.Значение = СвойствоАвто;
	//НаборЗаписей.Записать();
	//Возврат Договор.Ссылка;  
	Сообщить("Не найден Агентский договор с контрагентом "+Контрагент+ " для создания Взаимозачета.");
	Возврат Неопределено; 
	//БизТех >>

КонецФункции	
//>>Павличенко 11.07.2020

//----Функции общего назначения--Конец--
